Revit 2026 API

# WallCurtainGrid Property

---

Get the grid object of a curtain wall

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurtainGrid CurtainGrid { get; }
```
```vb
Public ReadOnly Property CurtainGrid As CurtainGrid
	Get
```
```cpp
public:
property CurtainGrid^ CurtainGrid {
	CurtainGrid^ get ();
}
```
```fsharp
member CurtainGrid : CurtainGrid with get
```

#### Property Value

CurtainGrid

This property is readonly.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace